{
    "Tamarine": {
        "name": "Tamarine Restaurant & Gallery",
        "address": "546 University Ave, Palo Alto, CA 94301",
        "phone": "(650) 325-8500",
        "description": "This modern Vietnamese restaurant at the top end of University Avenue has been serving shaking beef, lemongrass sea bass, and hoisin lamb chops since 2002. Owned by two sisters, the space is also a rotating art gallery and a power spot for cocktails. The menu includes a few rotating favorites from Tam Tam, the slightly more casual spot they opened in 2019 and closed in 2020.",
    },
    "President": {
        "name": "President's Terrace",
        "address": "488 University Ave, Palo Alto, CA 94301",
        "phone": "(650) 843-9755",
        "description": "Ever want to drink a Nutty Professor, a mai tai riff incorporating pistachio orgeat and pistachio foam, on a rooftop? What about a Weekend at Burning Man, a sultry combo of tequila, pineapple juice, and elote reduction? Both and more are available at the bar above the recently-remodeled Graduate Hotel.",
    },
    "Ethel": {
        "name": "Ethel's Fancy",
        "address": "550 Waverley St, Palo Alto, CA 94301",
        "phone": "(650) 561-4860",
        "description": "In October 2022 chef Scott Nishiyama opened a fine dining passion project to explore his Japanese American roots. Ethel’s Fancy delivers on that and so much more, serving dishes including toasted coconut fritters with wagyu beef and pickled green peppercorn vinaigrette in a restaurant named after both his mother and maternal grandmother.",
    },
    "BirdDog": {
        "name": "Bird Dog",
        "address": "420 Ramona St, Palo Alto, CA 94301",
        "phone": "(650) 656-8180",
        "description": "Chef Robbie Wilson, also behind San Francisco’s Le Fantastique, brought fine-dining pedigree to Palo Alto when he opened Bird Dog in 2015. The menu ranges from raw fish and fatty meats to locally farmed vegetables and grains, highlighting ingredients like bone marrow, amberjack, and Arrowhead cabbage.",
    },
    "RamenNagi": {
        "name": "Ramen Nagi Palo Alto",
        "address": "541 Bryant St, Palo Alto, CA 94301",
        "phone": "",
        "description": "Palo Alto was the first U.S. location for this popular ramen chain in 2018, and fans have been lining up ever since. They get handed menus and markers, and pick out noodle thickness and firmness, as well as garlic and chile levels. The ramen bowls come in four variations: the “original king” with creamy tonkotsu pork broth, the “green king” with fresh basil pesto, the “red king” laced with chiles, and the “black king” darkened with squid ink.",
    },
    "Bevri": {
        "name": "Bevri",
        "address": "530 Bryant St, Palo Alto, CA 94301",
        "phone": "(650) 384-6500",
        "description": "Bevri had the distinction of being the first Georgian restaurant in the Bay Area, and it’s hard to resist the khachapuri, bread shaped like a canoe and filled with melted cheese, let alone the plump khinkali dumplings. Don’t miss the wine list — Georgian wines are having a moment, but as the restaurant points out, the tradition goes back 8,000 years.",
    },
    "Ettan": {
        "name": "Ettan",
        "address": "518 Bryant St, Palo Alto, CA 94301",
        "phone": "(650) 752-6281",
        "description": "Ettan brings Michelin-pedigreed and James Beard-nominated California-Indian cuisine to Palo Alto in a bright, colorful patterned space serving “grazing” snacks of oysters topped with a fennel and curry leaf ponzu and sliders filled with jackfruit. Chef Srijith Gopinathan opened Copra in 2023, so taking stock of the cook’s Silicon Valley restaurant is basically just doing your homework.",
    },
    "Evvia": {
        "name": "Evvia Estiatorio",
        "address": "420 Emerson St, Palo Alto, CA 94301",
        "phone": "(650) 326-0983",
        "description": "Not to name drop big city sisters, but Evvia in Palo Alto is the sibling of Kokkari in San Francisco, and for anyone who’s cozied up by the fire and feasted on flame-licked lamb, it has the same warmth and charm. Menu highlights include the dolmathes, grilled octopus, and lamb riblets — but, really, anything twirling over the big hearth.",
    },
    "Oklava": {
        "name": "Oklava Cafe",
        "address": "205 University Ave, Palo Alto, CA 94301",
        "phone": "(650) 561-4898",
        "description": "There is an abundance of places to order baklava in the Bay Area, but not many with more than 20 varieties. This tiny cafe and bakery pumps out tons of flavors including double walnut, chocolate with pistachio, and carrot. The shop includes both Oklava and Kenz Coffee Bar, and also features heftier fare such as falafel and Turkish breakfasts.",
    },
    "Nola": {
        "name": "Nola",
        "address": "535 Ramona St, Palo Alto, CA 94301",
        "phone": "(650) 328-2722",
        "description": "With an emphasis on booze, blues, and New Orleans–style bon temps, Nola is a favorite among Stanford students, now with an even larger outdoor setup for lingering brunches. The three-story restaurant meant to resemble a French Quarter building serves Louisiana classics like gumbo and jambalaya, as well as distinctly non-Louisiana dishes like roasted cauliflower tacos and hot chicken sliders. The drinks are really the star here, with hurricanes, sazeracs, mojitos, and palomas all available in pitchers, as well as a menu of mini and zero-proof cocktails.",
    },
    "Coconuts": {
        "name": "Coconuts",
        "address": "642 Ramona St, Palo Alto, CA 94301",
        "phone": "(650) 329-9533",
        "description": "Originally from Jamaica, chef Robert Simpson brought jerk chicken, coconut shrimp, and goat curry to sunny Palo Alto. His colorful restaurant is actually affordable enough for students, and the skinny side patio is criss-crossed with twinkling lights.",
    },
    "Creamery": {
        "name": "The Palo Alto Creamery",
        "address": "566 Emerson St, Palo Alto, CA 94301",
        "phone": "",
        "description": "Stanford kids, software engineers, and actual children can’t resist the charms of this old-school soda fountain, which boasts a big wraparound counter and red booths. It’s classic California, originally opened in 1923, and still serving burgers, shakes, and damn good pie.",
    },
    "SaintMichaels": {
        "name": "Saint Michael's Alley",
        "address": "140 Homer Ave, Palo Alto, CA 94301",
        "phone":"(650) 326-2530",
        "description":"Though it originally opened as a bohemian coffee shop in 1959, Saint Michael’s Alley has since been turned into an upscale Californian restaurant by its current owners in 1993. And even though it’s moved around the corner to a new space, it’s still an intimate setting to cozy up with a date. Sundance the Steakhouse is another stand-up option for showing the visiting family a good time.",
    },
    "Zareen": {
        "name": "Zareen's",
        "address": "365 California Ave, Palo Alto, CA 94306",
        "phone": "(650) 600-8438",
        "description": "This fast-casual Pakistani and Indian spot always often has a line, but it moves at a good clip, as engineers in hoodies and sneakers load up on kebabs and curries, served on metal plates with lots of exciting compartments.",
    },
    "Terun": {
        "name": "Terún",
        "address": "448 California Ave, Palo Alto, CA 94306",
        "phone": "(650) 600-8310",
        "description": "San Francisco is known for excellent Neapolitan-style pizza, with pillowy and chewy doughs blistered in roaring ovens. But Palo Alto started throwing down when Terún moved into town. With a wood-fired oven that’s stoked and burning bright, these pies are the real deal, as certified by the Associazione Verace Pizza Napoletana, otherwise known as the pizza police.",
    }   
}